/*переписываю код по порядку с комментариями, чтобы было ну прямо вообще красиво*/
#include <stdio.h> // хедер стандартной библиотекки ввода/вывода для использования printf & scanf
#include <math.h> // библиотека мат. вычислений - для использования функции sqrt

double discrim(double a, double b, double c)

    /*функция для нахождения дискриминант уравнения - объявленные переменные - внутренние переменные, которые будут использоваться только в самой функции, мы можем при дальнейшем использовании функции спокойно подставлять туда наши значения, и они будут вертеться в функции без проблем*/
    {
        return b*b-4*a*c;
        /*так как записано, что функция double, то она и будет возвращать, чего ей скажут, удобно и коротко*/
    }

int main() // начало основной функции, которая возвращает целые значения
    {
        double p,q,r,d; // переменные для ввода параметров урованения
        int n; // целое число для подсчета правильного количества введенных параметров уравнения
        printf("Enter the values of equation:\n");
        n = scanf("%lf %lf %lf", &p,&q,&r); //забираем из потока ввода значения и помещаем их в адреса ячеек   
        
        /*ветвление для проверки правильного количества введенных переменных*/
        if(n!=3)
            {
                printf("Not all values are entered!\n");
                return 1;        
            }
        
        /*ветвление для проверки квадратности уравнения*/
        if(p == 0)
            {
                printf("not a quadric quation!\n");
                return 2;
            }
        /*вычисление дискриминанта с помощью заранее описанной функции*/
        d = discrim(p,q,r);
                
                /*если дискриминант меньше нуля*/
                if(d<0)
                {
                    printf("No root!\n");
                    return 0;
                }
        /*просто дискриминант, если все ок*/
        d = sqrt(d);
    /*использование фунции нахождения квадратного корня может вызвать ошибку неопределенной ссылки, для ее устранения при компиляции следует явно указать использование библиотеки math через флаг -lm: 
    gcc -Wall -g qeq.c -lm -o qeq*/
        printf("%.5f %.5f\n", (-q-d)/(2*p), (-q+d)/(2*p));
        return 0;
    }


