global      _start
section     .bss                ; секция памяти неин-ых переменных
array       resb 256            ; задание массива размеров 256 байт

section     .text               ; секция с основным кодом программы
_start:     mov ecx , 256       ; колво элементов в счетчик ECX
            mov edi , array     ; адрес массива в EDI (приемник)
            mov al ,  '@'       ; нужный в массив AL
again:      mov [edi],al        ; заносим код в очередной массив
            inc edi             ; увеличиваем адрес
            dec ecx             ; уменьшаем счетчик
            jnz again           ; если там не ноль, повторяем цикл
            
            